// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив,
//     в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends=["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if(friends.length>=3) {
    document.write("Это большой массив, в котором более трех элементов")
}
else{
    document.write("Это маленький массив")
}



// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше).
// Перевірити, чи знаходиться перше число між двома іншими.

let a=+prompt('Введите число ');
let b= +prompt('Введите число ');
let c= +prompt('Введите число ');
if (a<b && b<c) {
    console.log('b');
}
else if (b<a && a<c) {
    console.log('a');
}
else {console.log('c')};


// - Перепишіть конструкцію if з використанням умовного оператора '?':
let result;
if (a + b < 4) {
    result = 'Мало';
} else {
    result = 'Багато';
}
( может треба було  ще присвоїти числа змінним?)

let num = a+b;
let result = num ===(a+b<4)?'Мало':'Багато';

//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let num= +prompt('Введіть число від -100 до 100');

num < 0 && num > -100 ? (
    alert('Негативне'))

num > 0 && num < 100 ? (
    alert('Позитивне.'))
num === 0 ? (
    alert('Нулеве'))
//
// Ще такий варіант,

let num=();
let asd = num ===< 0 && num>-100?'Негативне':'Позитивне';
    num===0?'Нулеве';{
        console.log(asd)
}


